; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	thermograph2 - mode
	image1 - mode
	thermograph0 - mode
	Star1 - direction
	Star7 - direction
	GroundStation8 - direction
	GroundStation13 - direction
	GroundStation9 - direction
	Star6 - direction
	Star3 - direction
	Star4 - direction
	GroundStation0 - direction
	Star5 - direction
	Star12 - direction
	GroundStation10 - direction
	GroundStation2 - direction
	Star14 - direction
	GroundStation11 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Planet19 - direction
	Phenomenon20 - direction
	Planet21 - direction
	Phenomenon22 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star14)
	(calibration_target instrument0 Star12)
	(calibration_target instrument0 GroundStation9)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star6)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star12)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star14)
	(supports instrument2 thermograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation8)
	(supports instrument3 thermograph2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation10)
	(supports instrument4 thermograph2)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star14)
	(calibration_target instrument4 GroundStation10)
	(calibration_target instrument4 Star12)
	(supports instrument5 thermograph0)
	(supports instrument5 thermograph2)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation11)
	(calibration_target instrument5 Star14)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet15)
)
(:goal (and
	(have_image Planet15 thermograph2)
	(have_image Planet16 thermograph2)
	(have_image Phenomenon17 image1)
	(have_image Planet18 thermograph0)
	(have_image Planet19 image1)
	(have_image Phenomenon20 thermograph0)
	(have_image Planet21 thermograph0)
	(have_image Phenomenon22 image1)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 8
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 8
3. (turn_to satellite0 phenomenon17 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 phenomenon17)
   goals met: 0 of 8
4. (turn_to satellite1 star5 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star5)
   goals met: 0 of 8
5. (calibrate satellite1 instrument3 star5)
   added: (calibrated instrument3)
   goals met: 0 of 8
6. (turn_to satellite1 phenomenon20 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 phenomenon20)
   goals met: 0 of 8
7. (take_image satellite1 phenomenon20 instrument3 thermograph0)
   added: (have_image phenomenon20 thermograph0)
   goals met: 1 of 8
8. (turn_to satellite1 planet15 phenomenon20)
   deleted: (pointing satellite1 phenomenon20)
   added: (pointing satellite1 planet15)
   goals met: 1 of 8
9. (take_image satellite1 planet15 instrument3 thermograph2)
   added: (have_image planet15 thermograph2)
   goals met: 2 of 8
10. (turn_to satellite1 planet16 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet16)
   goals met: 2 of 8
11. (take_image satellite1 planet16 instrument3 thermograph2)
   added: (have_image planet16 thermograph2)
   goals met: 3 of 8
12. (turn_to satellite1 planet18 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet18)
   goals met: 3 of 8
13. (take_image satellite1 planet18 instrument3 thermograph0)
   added: (have_image planet18 thermograph0)
   goals met: 4 of 8
14. (turn_to satellite1 planet21 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 planet21)
   goals met: 4 of 8
15. (take_image satellite1 planet21 instrument3 thermograph0)
   added: (have_image planet21 thermograph0)
   goals met: 5 of 8
16. (turn_to satellite0 star4 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 star4)
   goals met: 5 of 8
17. (calibrate satellite0 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 5 of 8
18. (turn_to satellite0 phenomenon17 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon17)
   goals met: 5 of 8
19. (take_image satellite0 phenomenon17 instrument2 image1)
   added: (have_image phenomenon17 image1)
   goals met: 6 of 8
20. (turn_to satellite0 phenomenon22 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon22)
   goals met: 6 of 8
21. (take_image satellite0 phenomenon22 instrument2 image1)
   added: (have_image phenomenon22 image1)
   goals met: 7 of 8
22. (turn_to satellite0 planet19 phenomenon22)
   deleted: (pointing satellite0 phenomenon22)
   added: (pointing satellite0 planet19)
   goals met: 7 of 8
23. (take_image satellite0 planet19 instrument2 image1)
   added: (have_image planet19 image1)
   goals met: 8 of 8
